In [2]:
#importing the necessary databases
import os
import pandas as pd
from sqlalchemy import create_engine
import mysql.connector
import MySQLdb

In [3]:
#configuring mysql in jupyter
%load_ext sql
%config SqlMagic.autopandas=True

In [4]:
#connecting the database
os.environ['DATABASE_URL'] = 'mysql://ted:root@localhost:3306/ted'

# Create a database engine
engine = create_engine(os.environ['DATABASE_URL'])

In [5]:
%%sql
#creating a table to load data into from a csv file
CREATE TABLE population (
    Rank INT,
    CCA3 TEXT,
    Country TEXT,
    Capital TEXT,
    Continent TEXT,
    `2022Population` INT,
    `2020Population` INT,
    `2015Population` INT,
    `2010Population` INT,
    `2000Population` INT,
    `1990Population` INT,
    `1980Population` INT,
    `1970Population` INT,
    `Area(Km2)` INT,
    `Density(KM2)` FLOAT,
    Growthrate FLOAT,
    Worldpopulationpercentage FLOAT 
);

(MySQLdb._exceptions.OperationalError) (1050, "Table 'population' already exists")
[SQL: #creating a table to load data into from a csv file
CREATE TABLE population (
    Rank INT,
    CCA3 TEXT,
    Country TEXT,
    Capital TEXT,
    Continent TEXT,
    `2022Population` INT,
    `2020Population` INT,
    `2015Population` INT,
    `2010Population` INT,
    `2000Population` INT,
    `1990Population` INT,
    `1980Population` INT,
    `1970Population` INT,
    `Area(Km2)` INT,
    `Density(KM2)` FLOAT,
    Growthrate FLOAT,
    Worldpopulationpercentage FLOAT
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [6]:
%%sql
#loading the csv file into table named population
LOAD DATA INFILE 'world_population1.csv' INTO TABLE population
FIELDS TERMINATED BY ',' ENCLOSED BY '"' LINES TERMINATED BY '\n' IGNORE 1 ROWS;

 * mysql://ted:***@localhost:3306/ted
234 rows affected.

Empty DataFrame
Columns: []
Index: []

In [7]:
%%sql
#showing table info
SELECT * FROM population;

 * mysql://ted:***@localhost:3306/ted
702 rows affected.

,Rank,CCA3,Country,Capital,Continent,2022Population,2020Population,2015Population,2010Population,2000Population,1990Population,1980Population,1970Population,Area(Km2),Density(KM2),Growthrate,Worldpopulationpercentage
0,36,AFG,Afghanistan,Kabul,Asia,41128771,38972230,33753499,28189672,19542982,10694796,12486631,10752971,652230,63.0587,1.0257,0.52
1,138,ALB,Albania,Tirana,Europe,2842321,2866849,2882481,2913399,3182021,3295066,2941651,2324731,28748,98.8702,0.9957,0.04
2,34,DZA,Algeria,Algiers,Africa,44903225,43451666,39543154,35856344,30774621,25518074,18739378,13795915,2381741,18.8531,1.0164,0.56
3,213,ASM,American Samoa,Pago Pago,Oceania,44273,46189,51368,54849,58230,47818,32886,27075,199,222.4770,0.9831,0.00
4,203,AND,Andorra,Andorra la Vella,Europe,79824,77700,71746,71519,66097,53569,35611,19860,468,170.5640,1.0100,0.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
697,226,WLF,Wallis and Futuna,Mata-Utu,Oceania,11572,11655,12182,13142,14723,13454,11315,9377,142,81.4930,0.9953,0.00
698,172,ESH,Western Sahara,El Aaiún,Africa,575986,556048,491824,413296,270375,178529,116775,76371,266000,2.1654,1.0184,0.01
699,46,YEM,Yemen,Sanaa,Asia,33696614,32284046,28516545,24743946,18628700,13375121,9204938,6843607,527968,63.8232,1.0217,0.42
700,63,ZMB,Zambia,Lusaka,Africa,20017675,18927715,16248230,13792086,9891136,7686401,5720438,4281671,752612,26.5976,1.0280,0.25
701,74,ZWE,Zimbabwe,Harare,Africa,16320537,15669666,14154937,12839771,11834676,10113893,7049926,5202918,390757,41.7665,1.0204,0.20

In [8]:
%%sql
#showing the most populated country
SELECT Country, 2022Population AS MostPopulated FROM population
 WHERE 2022Population =
(SELECT MAX(2022Population) FROM population);

 * mysql://ted:***@localhost:3306/ted
3 rows affected.

  Country  MostPopulated
0   China     1425887337
1   China     1425887337
2   China     1425887337

In [9]:
%%sql
#showing the least populated country
SELECT Country, 2022Population AS LeastPopulated FROM population
 WHERE 2022Population = 
(SELECT MIN(2022Population) FROM population);

 * mysql://ted:***@localhost:3306/ted
3 rows affected.

        Country  LeastPopulated
0  Vatican City             510
1  Vatican City             510
2  Vatican City             510

In [10]:
%%sql
#showing the total world population IN 1970
SELECT SUM(`1970Population`) AS `World_population_1970` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_1970
0           11082409983

In [11]:
%%sql
#showing world population in 1980
SELECT SUM(`1980Population`) AS `World_population_1980` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_1980
0           13327201113

In [12]:
%%sql
#showing world population in 1990's
SELECT SUM(`1990Population`) AS `World_population_1990` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_1990
0           15942574995

In [13]:
%%sql
#showing world population in 2000's
SELECT SUM(`2000Population`) AS `World_population_2000` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_2000
0           18441167109

In [14]:
%%sql
# showing world population in 2010
SELECT SUM(`2010Population`) AS `World_population_2010` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_2010
0           20951354994

In [15]:
%%sql
#showing world population in 2015
SELECT SUM(`2015Population`) AS `World_population_2015` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_2015
0           22274429283

In [16]:
%%sql
#showing world population in 2020
SELECT SUM(`2020Population`) AS `World_population_2020` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_2020
0           23517751809

In [17]:
%%sql
#showing world population in 2022
SELECT SUM(`2022Population`) AS `World_population_2022` FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

  World_population_2022
0           23920239126

In [18]:
%%sql
#showing the country with the highest growth rate(in percentage)
SELECT Country, MAX(Growthrate) AS HighestGrowthRate FROM population;

 * mysql://ted:***@localhost:3306/ted
1 rows affected.

       Country  HighestGrowthRate
0  Afghanistan             1.0691

In [19]:
%%sql
#showing the country with the least growth rate in percentage
SELECT Country, Growthrate AS LowestGrowthRate FROM population
WHERE Growthrate =
(SELECT MIN(Growthrate) FROM population)

 * mysql://ted:***@localhost:3306/ted
3 rows affected.

   Country  LowestGrowthRate
0  Ukraine             0.912
1  Ukraine             0.912
2  Ukraine             0.912

In [38]:
%%sql
SELECT DISTINCT Continent FROM population;

 * mysql://ted:***@localhost:3306/ted
6 rows affected.

       Continent
0           Asia
1         Europe
2         Africa
3        Oceania
4  North America
5  South America

In [43]:
%%sql
#showing the most populated country by continent
SELECT DISTINCT Continent, Country, `2022Population`
FROM population
WHERE (`2022Population`, Continent) IN (
    (SELECT MAX(`2022Population`), 'Asia' FROM population WHERE Continent = 'Asia'),
    (SELECT MAX(`2022Population`), 'Africa' FROM population WHERE Continent = 'Africa'),
    (SELECT MAX(2022Population), 'Europe' FROM population WHERE Continent = 'Europe'),
    (SELECT MAX(2022Population), 'Oceania' FROM population WHERE Continent = 'Oceania'),
    (SELECT MAX(2022Population), 'North America' FROM population WHERE Continent = 'North America'),
    (SELECT MAX(2022Population), 'South America' FROM population WHERE Continent = 'South America')
    
)
ORDER BY Continent;

 * mysql://ted:***@localhost:3306/ted
6 rows affected.

       Continent        Country  2022Population
0         Africa        Nigeria       218541212
1           Asia          China      1425887337
2         Europe         Russia       144713314
3  North America  United States       338289857
4        Oceania      Australia        26177413
5  South America         Brazil       215313498

In [44]:
%%sql
#showing the least populated country by continent
SELECT DISTINCT Continent, Country, `2022Population`
FROM population
WHERE (`2022Population`, Continent) IN (
    (SELECT MIN(`2022Population`), 'Asia' FROM population WHERE Continent = 'Asia'),
    (SELECT MIN(`2022Population`), 'Africa' FROM population WHERE Continent = 'Africa'),
    (SELECT MIN(2022Population), 'Europe' FROM population WHERE Continent = 'Europe'),
    (SELECT MIN(2022Population), 'Oceania' FROM population WHERE Continent = 'Oceania'),
    (SELECT MIN(2022Population), 'North America' FROM population WHERE Continent = 'North America'),
    (SELECT MIN(2022Population), 'South America' FROM population WHERE Continent = 'South America')
    
)
ORDER BY Continent;

 * mysql://ted:***@localhost:3306/ted
6 rows affected.

       Continent           Country  2022Population
0         Africa        Seychelles          107118
1           Asia            Brunei          449002
2         Europe      Vatican City             510
3  North America        Montserrat            4390
4        Oceania           Tokelau            1871
5  South America  Falkland Islands            3780